Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ནི་ཡང་དག་པར་བསྔགས་ཏེ་བཏང་། དགེ་བའི་བཤེས་གཉེན་མཐོང་བའི་བྱིན་གྱིས་ནི་བྱིན་དུ་བརླབས། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནི་ནན་ཏན་དུ་བྱེད། དགེ་བའི་བཤེས་གཉེན་ཡིད་དུ་འོང་བ་ནི་རྗེས་སུ་སེམས། དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་འབྱུང་གནས་ཙམ་དུ་ལྟ། དགེ་བའི་བཤེས་གཉེན་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སྟོན་པ་ཡིན་པར་ཡང་དག་པར་ལྟ། དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ལ་རྗེས་སུ་ལྟ།
en: Sudhana, the head merchant’s son, delighted by the qualities of the kalyāṇamitra, sent forth by the kalyāṇamitra, empowered by the sight of the kalyāṇamitra, practicing the instructions of the kalyāṇamitra, remembering the words of the kalyāṇamitra, and contemplating the kalyāṇamitra with affection, saw kalyāṇamitras as the source of the Buddhadharma, saw kalyāṇamitras as the teachers of the Buddhadharma, saw kalyāṇamitras as masters in the Dharma of omniscience, and saw the kalyāṇamitras as eyes that look into the sky of buddhahood.

source: དགེ་བའི་བཤེས་གཉེན་ནི་སངས་རྒྱས་ནམ་མཁའ་བལྟ་བ་ལ་མིག་ཙམ་ཏུ་ལྟ་ཞིང་མཐར་གྱིས་ཕྱོགས་ཀྱི་གནས་རྒྱ་མཚོ་རྣམ་པར་རློབ་པའི་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ།
en: Eventually he came to the Samanta­vyūha Park in Samudravetāḍī.

source: གང་ན་བ་དེར་ཕྱིན་ནས་དེས་མཐོང་བ། བཟའ་ཤིང་གི་རབ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ར་བས་ཀུན་ནས་བསྐོར་བ། རིན་པོ་ཆེའི་ཤིང་གི་ཕྲེང་བ་སྤེལ་བ་ལེགས་པས་ཡོངས་སུ་བརྒྱན་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གི་ཕྲེང་བའི་མེ་ཏོག་སྲབ་བུ་ཡིད་དུ་འོང་བའི་སྤྲིན་རབ་ཏུ་འབྲུལ་བས་གཞི་རྒྱས་པ།
en: He saw the Samanta­vyūha Park, which was encircled by precious walls and rows of precious trees that were perfectly adorned and by rows of beautiful, delicate flowers, made of all precious materials, that released clouds of pollen that were spread across the ground. It was adorned by trees made of all precious materials.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གིས་ཡང་དག་པར་བརྒྱན་པ། ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ།
en: It was filled with a variety of blossoming flowers of precious trees.

source: སྤོས་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ཕྲེང་བ་ལས་ཕྱོགས་ཀུན་ཏུ་སྤོས་ཀྱི་ངད་ཞིམ་པ་རིན་པོ་ཆེའི་ཕྲེང་བའི་ཤིང་སྣ་ཚོགས་ཀྱི་ལྷུན་ལས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་འཕྱང་བ། རབ་ཏུ་འབྱུང་ཞིང་ཆར་ལྟར་མངོན་པར་བབ་པ།
en: The beautiful aroma from rows of various incense trees spread in every direction. Strings of all kinds of jewels were hanging from the various trees like a rainfall of strings of jewels showering down.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ཤིང་དང་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་མཛེས་ཤིང་སྤ་ལ།
en: The trees made of all the kings of jewels were bestrewed, bedecked, and beautified by a variety of precious jewels.

source: རྒྱ་ཆེར་བརྒྱན་པའི་གཞི་ཅན་ཡིད་བཞིན་གྱི་གོས་ཀྱི་ཤིང་ཐམས་ཅད་ལས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་གོས་འབྱུང་བས་གམ་ཡོ་ཁེབས་ཤིང་མཛེས་པར་བརྒྱན་པ།
en: All the wish-fulfilling flower trees were beautified and covered by being draped with clothing of various colors.

source: སིལ་སྙན་གྱི་ཤིང་ཐམས་ཅད་ལས་ལྷ་རྫས་ལས་ཀྱང་འཕགས་པའི་སིལ་སྙན་རླུང་གིས་བསྐྱོད་ཅིང་སྒྲ་འབྱིན་པའི་དབྱངས་སྙན་པར་འབྱུང་བ།
en: When all the musical trees were moved by the breeze there came the beautiful sound of music from instruments superior to those of the devas.

source: སའི་གཞི་མཐོན་དམན་མེད་པར་གནས་པ་རྒྱན་གྱི་ཤིང་སྣ་ཚོགས་ཀྱི་གསེབ་ནས། རྒྱན་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་རྒྱུན་ཏུ་འབྱུང་ཞིང་འཕྱང་བས། རབ་ཏུ་བརྒྱན་པའི་རྒྱན་དང་ལྡན་པ་མཐོང་སྟེ།
en: The ground was perfectly level , and upon it was the display of all the various kinds of adorned trees that were hung and beautified with various kinds of ornaments.

source: བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པ་དེའི་ནང་ན་ཁང་པ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཀུན་ཀྱང་ནོར་བུ་རིན་པོ་ཆེ་དམ་པ་སྣ་ཚོགས་ཀྱི་བ་གམ་གྱིས་རྣམ་པར་བརྒྱན་པ་དང་། ཁང་པ་བརྩེགས་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་བརྩེགས་པའི་བད་དང་ལྡན་པ་དང་། གཞལ་མེད་ཁང་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཀ་གདུང་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བ། ལས་བྲེས་པ།
en: Within the great park of Samanta­vyūha there were ten trillion mansions that had an array of spires made of the best precious jewels;

source: རྫིང་བུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་གཞི་བླངས་ཏེ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཕ་གུས་མུ་ཁྱུད་བྱས་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཐེམ་སྐས་བཏགས་པ།
en: there were a hundred thousand kūṭāgāras with their towers covered with Jambu River gold;

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྟེགས་བུས་བསྐོར་བ། ལྷ་རྫས་ཀྱི་ཙན་དན་གྱི་དྲི་དང་ལྡན་པའི་ཆུས་གང་བ། གསེར་གྱི་བྱེ་མས་ཀུན་ཏུ་གྲམ་པ།
en: there were a hundred thousand aerial palaces with interiors beautified by shining precious jewels;

source: གཞི་ནོར་བུ་རིན་པོ་ཆེ་ཆུ་འདང་ཀུན་ཏུ་བཀྲམ་པ། ཕྱོགས་བཞི་ནས་ཐེམ་སྐས་རྣམ་པར་བྲེས་པ། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་གང་བ། ང་དུར་དང་། རྨ་བྱ་དང་། ཁུ་བྱུག་དང་། ཁྲུང་ཁྲུང་དང་། ཀ་ལ་པིང་ཀ་དང་། ཀུ་ན་ལའི་སྒྲ་སྐད་སྙན་པའི་དབྱངས་དང་ལྡན་པ། རིན་པོ་ཆེའི་ཏ་ལའི་ཕྲེང་བས་ཀུན་ནས་བརྒྱན་པ། གསེར་གྱི་དྲིལ་བུའི་དྲ་བས་ཀུན་ནས་ཡོག་པ། རླུང་གིས་བསྐྱོད་པའི་སྒྲ་ཡིད་དུ་འོང་བ་འབྱུང་བ།
en: there were a million ponds made of all precious materials, with walls made of bricks of various precious materials and with steps made of all precious materials, encircled by a balcony of various precious materials, filled with water that had the aroma of divine sandalwood, strewn with gold dust, their bottoms spread with precious water-purifying jewels, adorned on all four sides with stairways, filled with water that had the eight qualities, with geese, peacocks, cuckoos, cranes, and avadavats all emitting divine melodious songs, encircled by rows of precious palm trees hung with networks of little golden bells that emitted beautiful sounds when they were shaken by breezes, covered with a precious canopy, encircled by a wall of trees made of various precious materials, and with standing parasols and banners draped in nets of jewels.

source: སྟེང་ནས་རིན་པོ་ཆེའི་བླ་རེ་ཆེན་པོ་བྲེས་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ར་བས་ཡོངས་སུ་བསྐོར་བ། རིན་པོ་ཆེའི་དྲ་བས་བརྒྱན་པའི་གདུགས་དང་རྒྱལ་མཚན་ལེགས་པར་བསྒྲེང་བ། ལུ་མ་བརྒྱ་སྟོང་ཕྲག་བཅུ་དུས་དང་མཐུན་པའི་ཙན་དན་གྱི་འདམ་གྱིས་མཐའ་འཁོར་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཏུ་འདུག་པའི་པད་མོས་ཡོངས་སུ་ཁྱབ་པ། རིན་པོ་ཆེའི་པད་མོའི་འོད་ཆེན་པོས་སྣང་བར་གྱུར་པའི་ཆུ་དྲི་མ་མེད་པ་དང་ལྡན་པ་ཡོད་པ་སྟེ།
en: All around there were a million ponds with yellow sandalwood mud, covered with lotuses of various colors made from all precious materials and filled with stainless water illuminated by the great radiance of the precious lotuses.

source: བཟའ་ཤིང་གི་ར་བ་དེའི་དབུས་ན་གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱལ་མཚན་སྣ་ཚོགས་ཞེས་བྱ་བ།
en: In the center of Samanta­vyūha Park there was a great aerial palace called Vicitra­dhvaja.

source: སའི་གཞི་རིན་པོ་ཆེ་རྒྱ་མཚོའི་སྙིང་པོ་ལས་བླངས་པ།
en: It had a floor made of jewels from within the ocean;

source: ནོར་བུ་རིན་པོ་ཆེའི་ཀ་བ་བཀྱེ་བ་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་ལྷུན་མངོན་པར་འཕགས་པ་ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བར་རྣམ་པར་སྣང་བའི་སྤང་ལེབ་བཀྱེ་བས་བརྒྱན་པ།
en: it was adorned by beryl jewel pillars, with a high spire of Jambu River gold and with floorboards that were a display of precious jewels that illuminated the world;

source: གཞི་ནོར་བུ་རིན་པོ་ཆེ་འབར་བ་གྲངས་མེད་པའི་དྲ་བས་བྲེས་པ།
en: and it was draped in countless nets of shining precious jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་མི་ཕམ་པའི་སྤོས་ཀྱི་དྲིས་གམ་ཡོ་ཀུན་ནས་བདུགས་པ། རིན་པོ་ཆེའི་རྒྱལ་པོ་སྒྲ་སྙན་པ་འབྱིན་པའི་དྲི་ངད་ཀུན་ཏུ་ལྡང་བ།
en: It had the scent of the perfume of the invincible kings of jewels that perfume the environs, the scent of the kings of music-emitting jewels that spread everywhere, and the kings of stain-eliminating jewels that establish the propensities for sharp faculties.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲི་རྣམ་པར་གསལ་བར་བྱེད་པས་དབང་པོ་རྣོ་བའི་བག་ཆགས་རྣམ་པར་བསྒྲུབ་པ་དང་ལྡན་ཞིང་གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱལ་མཚན་སྣ་ཚོགས་དེར་སྟན་གྲངས་མེད་ཅིང་ཚད་མེད་པ་བཏིང་བར་གྱུར་པ་འདི་ལྟ་སྟེ་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་སྣང་བར་བྱེད་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་འགྲོ་བ་ཡིད་དུ་འོང་བའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་མཛོད་སྣ་ཚོགས་ཀྱི་པད་མོའི་སྙིང་པོ་ཅན་དང་། རིན་པོ་ཆེ་སེང་གེའི་ཤིང་ཐགས་ཀྱི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་དྲི་མ་མྱེད་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེས་བརྒྱན་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྒོ་ཀུན་ནས་བརྒྱན་པའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་འོད་ཀྱི་རྒྱན་གྱི་པད་མའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྒྱ་མཚོའི་གནས་རྣམ་པར་དག་པའི་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པའི་འོད་ཟེར་ཀུན་ཏུ་འབྱུང་བའི་པད་མོའི་སྙིང་པོ་ཅན་དང་། ནོར་བུ་རིན་པོ་ཆེ་རྡོ་རྗེའི་སེང་གེས་གནོན་པའི་པད་མོའི་སྙིང་པོ་ཅན་དག་བཤམས་ཤིང་བཏིང་བ་སྟེ།
en: In this celestial mansion called Vicitra­dhvaja, countless, innumerable seats, which were lotus pericarps, had been arranged. There had been arranged and set out lotus pericarps of precious jewels that illuminated the directions, lotus pericarps of shining precious jewels, lotus pericarps of precious jewels that illuminated the world, lotus pericarps that were manifold treasuries of precious jewels, lotus pericarps of lion-cage precious jewels, lotus pericarps of stainless precious jewels, lotus pericarps that were a display of precious jewels, lotus pericarps of precious jewels that faced everywhere, lotus pericarps of precious jewels that were a display of lights, lotus pericarps of pure precious jewels from the ocean, which were precious jewels that shone with light rays, and lotus pericarps of overpowering vajra-lion precious jewels.

source: གཞལ་མེད་ཁང་ཆེན་པོ་རྒྱལ་མཚན་སྣ་ཚོགས་དེའི་བ་གམ་མང་པོ་ཡང་། རིན་པོ་ཆེ་བསམ་གྱིས་མི་ཁྱབ་པ་ལས་བྱས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྒྱན་པ། ཁ་དོག་བསམ་གྱིས་མི་ཁྱབ་པར་མཛེས་ཤིང་གཟུགས་ཡིད་དུ་འོང་བ་དག་གོ །བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་བརྒྱན་པ་དེ།
en: The celestial mansion Vicitra­dhvaja had many pinnacles made of countless jewels, displaying an array of various jewels that were beautiful, attractive, and delightful, with countless colors.

source: སྟེང་ནས་བླ་རེ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཁེབས་པ་སྟེ།
en: A million great canopies covered the Samanta­vyūha Park from above.

source: འདི་ལྟར་གོས་ཀྱི་བླ་རེ་དང་ཁྲི་ཤིང་གི་བླ་རེ་དང་མེ་ཏོག་གི་བླ་རེ་དང་། ཕྲེང་བའི་བླ་རེ་དང་། སྤོས་ཀྱི་བླ་རེ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་བླ་རེ་དང་། གསེར་གྱི་བླ་རེ་དང་། རྒྱན་གྱི་བླ་རེ་དང་། རིན་པོ་ཆེ་རྡོ་རྗེ་སྣང་བའི་བླ་རེ་དང་། གླང་པོའི་ཤུགས་དང་ལྡན་པས་སྤྲུལ་པའི་ལྷ་མོའི་བླ་རེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་བརྒྱ་བྱིན་མངོན་པར་དགའ་བའི་བླ་རེ་དང་། དེ་དག་ལ་སོགས་པ་བླ་རེ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཁེབས་པར་བྱས་པའོ།
en: There were canopies of cloth, canopies of creepers, canopies of flowers, canopies of garlands, perfumed canopies, canopies of jewels, canopies of gold, canopies of adornments, canopies of shining diamond jewels, canopies of apsarases conjured by Airāvaṇa the king of elephants, canopies of the precious jewels that are worn by Śakra, and so on—a million such canopies completely covered the park. The park was covered with a million precious networks. There were networks of precious bells; networks of precious parasols; networks of precious images; networks of pearls, the essences of the sea;

source: །རིན་པོ་ཆེའི་དྲ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཡོག་པ་སྟེ།
en: networks of precious blue beryl jewels; networks of lion-vine ornaments;

source: འདི་ལྟར་རིན་པོ་ཆེ་དམ་པའི་དྲིལ་བུའི་དྲ་བ་དང་། རིན་པོ་ཆེའི་གདུགས་ཀྱི་དྲ་བ་དང་། རིན་པོ་ཆེའི་འབྲུའི་དྲ་བ་དང་། མུ་ཏིག་རྒྱ་མཚོའི་སྙིང་པོའི་དྲ་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་བཻཌཱུརྱ་སྔོན་པོའི་དྲ་བ་དང་། སེང་གེའི་ཁྲི་ཤིང་གི་དྲ་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆུ་ཤེལ་གྱི་དྲ་བ་དང་། སྤོས་ཀྱི་གཟུགས་ཀྱི་དྲ་བ་དང་། རིན་པོ་ཆེའི་ཅོད་པན་དང་། རིན་པོ་ཆེའི་ཕྲེང་བའི་དྲ་བ་དང་། དེ་དག་ལ་སོགས་པ་རིན་པོ་ཆེའི་དྲ་བ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་ཡོག་པ།
en: networks of precious moonstone jewels; networks of perfumed shapes; networks of precious crowns; networks of precious strings of beads; and so on—a million such networks completely covered the park.

source: སྣང་བ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ཀྱང་ཀུན་ནས་ཡོག་པ་སྟེ།
en: The park was also covered with a million great radiances.

source: འདི་ལྟར་ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་འོད་ཟེར་གྱི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཉི་མའི་སྙིང་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཟླ་བའི་རྒྱལ་མཚན་གྱི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྤོས་ཀྱི་དུད་པ་འོད་འཕྲོ་བའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་སྙིང་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་པད་མོའི་སྙིང་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་རྒྱལ་མཚན་གྱི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྒྲོན་མ་ཆེན་པོའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཕྱོགས་ཀུན་ཏུ་རྣམ་པར་སྣང་བའི་སྣང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྤོས་ཀྱི་སྤྲིན་ཆེན་པོ་དང་། ཀློག་གི་ཕྲེང་བ་འབྱུང་བའི་སྣང་བ་དང་། དེ་དག་ལ་སོགས་པ་ནོར་བུ་རིན་པོ་ཆེའི་སྣང་བ་ཆེན་པོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་རྟག་ཏུ་སྣང་བར་བྱས་པའོ།
en: There was the radiance of precious starlight jewels, the radiance of precious sunstones, the radiance of precious moon-banner jewels, the radiance of precious incense-smoke jewels, the radiance of precious lotus-essence jewels, the radiance of precious star-banner jewels, the radiance of precious great-lamp jewels, the radiance of precious all-illuminating jewels, the radiance of precious great-clouds-of-perfume jewels, the radiance of precious garlands-of-lightning jewels, and so on—a million such great radiances from precious jewels illuminated the park.

source: །བཟའ་ཤིང་གི་ར་བ་དེ་ནི་རྒྱན་ཆེན་པོའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུའི་ཆར་འབབ་པའི་རྒྱན་དང་ལྡན་པ་སྟེ།
en: In that park there were a million great clouds of adornments that rained down adornments;

source: དུས་དང་མཐུན་པའི་ཙན་དན་གྱི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུའི་འབྲུག་སྒྲ་རབ་ཏུ་འབྱུང་བ།
en: there was thunder from a million clouds of yellow sandalwood;

source: ལྷ་རྫས་ལས་འདས་པའི་ཕྲེང་བ་དང་། ལྡ་ལྡིའི་སྤྲིན་ཆེན་པོ་ཀུན་ཏུ་མཆེད་པས་རབ་ཏུ་བརྒྱན་པ།
en: there was the beauty of a million clouds of hanging garlands and wreaths that transcended those of the devas;

source: ལྷ་རྫས་ལས་འདས་པའི་གོས་ཚོན་སྣ་ཚོགས་དང་ལྡན་པའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུའི་སྤྲིན་མངོན་པར་འབབ་པ།
en: there was the rain from a million clouds of various kinds of clothing that transcended those of the devas;

source: ལྷ་རྫས་ལས་འདས་པའི་རྒྱན་གྱི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུས་རྣམ་པར་ཀླུབས་པ།
en: there was the beautification from a million clouds of adornments that transcended those of the devas;

source: ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་བཅུ་མཐོང་བར་དགའ་སྟེ། འོག་ཏུ་ལྟ་ཞིང་རབ་ཏུ་འདུད་པའི་ཕྱག་ཆར་བཞིན་དུ་འབབ་པ།
en: there was a cloud of a million devas who, wishing to see, looked downward and bowed their bodies in a rainfall of homage;

source: ལྷ་མོའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་སྔོན་གྱི་སྤྱོད་པའི་སྐལ་བ་མཉམ་པས་རང་རང་གི་ལུས་འབུལ་བའི་ཆར་མངོན་པར་འབབ་པ།
en: there was a cloud of a million apsarases, with the same extent of past conduct, who sent down a rain of the offering of their bodies;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཆོས་མཉན་པས། སྐོམ་ཞིང་འོང་བའི་ཆར་མངོན་པར་འབབ་སྟེ།
en: and there was a cloud of a million bodhisattvas listening to the Dharma and sending down a rain for those who are thirsty.

source: དེ་ན་དགེ་བསྙེན་མ་ཡིད་བཞིན་གསེར་གྱི་སྙིང་པོའི་ཁྲི་ཆེན་པོ་ལ་འདུག་ཅིང་། མུ་ཏིག་རྒྱ་མཚོའི་སྙིང་པོའི་དྲ་བས་བརྒྱན་པའི་ཅོད་པན་ཐོགས་པ།
en: The upāsikā Āśā was seated there on a great throne of the essence of gold, wearing a crown of a net of pearls, the essences of the sea;

source: ལག་པ་ལ་ལྷ་རྫས་ལས་འདས་པའི་གསེར་གྱི་དཔུང་རྒྱན་དང་། གདུབ་བུ་ཐོགས་པ།
en: wearing on her arms gold armlets and bracelets transcending those of the devas;

source: ལག་པ་ནོར་བུ་རིན་པོ་ཆེ་དཔལ་གྱི་རང་བཞིན་གྱི་འོད་ཟེར་གྱིས་རྣམ་པར་མཛེས་པར་གྱུར་པ།
en: her arms adorned by precious jewels shining with glorious light rays;

source: རྣ་ཆ་རིན་པོ་ཆེ་མཐོན་ཏིང་དྲི་མ་མེད་པ་རབ་ཏུ་འཕྱང་བ།
en: wearing precious, stainless, dark blue pendant earrings;

source: མགོ་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བས་མཛེས་པར་བརྒྱན་པ།
en: her head beautifully adorned by a net of precious jewels;

source: ནོར་བུ་རིན་པོ་ཆེ་སེང་གེའི་གདོང་གི་རྣ་བའི་གོང་རྒྱན་ཐོགས་པ།
en: wearing precious lion-face jewels on the upper part of her ears;

source: ནོར་བུ་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་མགུལ་ཀོར་ཐོགས་པ།
en: wearing a necklace of precious king of wish-fulfilling jewels at her throat;

source: ལུས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་དྲ་བས་ཡོག་ཅིང་འོད་རབ་ཏུ་འབར་བ།
en: her body covered in a brightly shining net of all jewels.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་གི་ལུས་རབ་ཏུ་བཏུད་དེ། ཕྱག་བྱ་བ་ཞིག་འདུག་སྟེ།
en: A quintillion beings were bowing down to her in homage.

source: དགེ་བསྙེན་མ་ཡིད་བཞིན་དེའི་དྲུང་དུ་ཤར་ཕྱོགས་ནས་ཚངས་པ་ཆེན་པོའམ། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པའི་རིས་སུ་གཏོགས་པའམ། དབང་བྱེད་དམ། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་རིས་སུ་གཏོགས་པའམ། རབ་འཕྲུལ་དགའ་འམ། འཕྲུལ་དགའི་རིས་སུ་གཏོགས་པའམ། རབ་དགའ་ལྡན་ནམ། དགའ་ལྡན་གྱི་རིས་སུ་གཏོགས་པ་འམ། རབ་མཚེ་མ་འམ། མཚེ་མའི་རིས་སུ་གཏོགས་པའམ། ལྷའི་དབང་པོ་འམ། སུམ་ཅུ་རྩ་གསུམ་གྱི་རིས་སུ་གཏོགས་པའམ། གནོད་སྦྱིན་གྱི་དབང་པོའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའི་དབང་པོའམ། དྲི་ཟ་འམ། གྲུལ་བུམ་གྱི་དབང་པོའམ། གྲུལ་བུམ་འམ། ཀླུའི་དབང་པོ་འམ། ཀླུའམ། ལྷ་མ་ཡིན་གྱི་དབང་པོའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་གི་དབང་པོའམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅིའི་དབང་པོའམ། མི་འམ་ཅི་འམ།
en: In front of this upāsikā, there came from the eastern direction countless, innumerable beings:

source: ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོ་འམ། གཤིན་རྗེ་འམ། གཤིན་རྗེའི་བུ་མོ་འམ། ཡི་དགས་རྫུ་འཕྲུལ་ཆེན་པོའམ།
en: Mahābrahmās, court priests of Brahmās, and Brahmakāyika devas, Vaśavartins and Para­nirmita­vaśa­vartin devas, Sunirmitas and Nirmāṇarati devas, Saṃtuṣitas and Tuṣita devas, Suyāmas and Yāma devas, Devendra and Trāyastriṃśa devas, lords of yakṣas and yakṣas, lords of gandharvas and gandharvas, lords of kumbhāṇḍas and kumbhāṇḍas, lords of nāgas and nāgas, lords of asuras and asuras, lords of garuḍas and garuḍas, lords of kinnaras and kinnaras, lords of mahoragas and mahoragas, Yamas and Yama daughters, pretas with great power and pretas, and lords of humans and humans.

source: ཡི་དགས་སམ། མིའི་དབང་པོའམ། མིའང་རུང་སྟེ། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་འོང་བ་དང་། དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་། བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ནས་ཀྱང་།
en: In the same way, from the south, the west, the north, the northeast, the southeast, the southwest, the northwest, above, and below there came many beings:

source: ཚངས་པ་ཆེན་པོའམ། ཚངས་ལྷ་ཉེ་ཕན་ནམ། ཚངས་པའི་རིས་སུ་གཏོགས་པའམ། དབང་བྱེད་དམ། དབང་བྱེད་ཀྱི་རིས་སུ་གཏོགས་པ་ནས། མིའི་དབང་པོའམ། མིའི་བར་གྱི་སེམས་ཅན་མང་པོ་འོང་བ། དེ་དག་ནད་སྣ་ཚོགས་ཞིག་གིས་བཏབ་པའམ།
en: Mahābrahmās, court priests of Brahmās, Brahmakāyika devas, Vaśavartins , Para­nirmita­vaśa­vartin devas, and so on, up to lords of humans and humans.

source: ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་འཁོར་ཏམ། ལྟ་བའི་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་ཞེན་ཏམ། ལས་ཀྱི་སྒྲིབ་པས་བསྒྲིབས་པ་ཞིག་ཡོད་ནའང་། དེ་དག་གིས་དགེ་བསྙེན་མ་ཡིད་བཞིན་དེ་མཐོང་མ་ཐག་ཏུ་ནད་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་གྱུར། སེམས་ཅན་གྱི་ཉོན་མོངས་པའི་དྲི་མ་དང་ཡང་བྲལ་བར་གྱུར། ལྟ་བའི་གསལ་ཤིང་ཡང་ཕྱིན་པར་གྱུར། སྒྲིབ་པའི་རི་ཐམས་ཅད་ཀྱང་རྣམ་པར་བཤིག་པར་གྱུར། རྣམ་པར་དག་པའི་དཀྱིལ་འཁོར་བསྒྲིབས་པ་མེད་པ་ཡང་ཁོང་དུ་ཆུད་པར་གྱུར་ཏེ། རྣམ་པར་དག་པའི་དཀྱིལ་འཁོར་དེ་ཡོད་པས་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བྱང་བར་གྱུར། དབང་པོའི་མྱུ་གུ་ཐམས་ཅད་ཀྱང་རྣམ་པར་འཕེལ་བར་གྱུར། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཡང་དག་པར་གཞོལ་བར་གྱུར། གཟུངས་ཀྱི་སྒོ་རྒྱ་མཚོ་ཐམས་ཅད་ལའང་འཇུག་པར་གྱུར། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་མངོན་སུམ་དུ་གྱུར། སྨོན་ལམ་གྱི་སྒོ་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་སྐྱེ་བར་གྱུར། སྤྱོད་པའི་སྒོ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་བྱུང་བར་གྱུར། ཡོན་ཏན་མངོན་པར་བསྒྲུབ་པའི་སྒོ་ཐམས་ཅད་ཀྱང་རྣམ་པར་དག་པར་གྱུར།
en: All those who suffered from various illnesses, were mired in various kleśas, were attached to various wrong views, or were obscured by karmic obscurations, as soon as they saw Upāsikā Āśā, were healed of their illnesses, became freed from the kleśas that stained their minds, departed from their erroneous views, had all their mountains of obscurations destroyed, and entered the pure field of freedom from obscurations, and within that pure field they purified all their roots of merit, caused all the seedlings of their faculties to grow, became dedicated to the ocean of the way of omniscient wisdom, entered the entire ocean of the gateways to the power of retention, faced the entire ocean of the gateways of samādhis, developed all the gateways of prayer, gave rise to all the gateways of conduct, purified all the gateways of the accomplishment of qualities, gave rise to the ways of all the clairvoyances of a vast mind, and could go anywhere with unimpeded bodies.

source: སེམས་རྒྱ་ཆེན་པོ་ཡང་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་ལྡན་པའི་ཚུལ་དུ་བྱུང་བར་གྱུར། ལུས་ཐོགས་པ་མེད་པས་ཀྱང་ཐམས་ཅད་དུ་རྗེས་སུ་འགྲོ་བར་གྱུར་ཏོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཟའ་ཤིང་གི་ར་བ་ཀུན་ནས་རྣམ་པར་བརྒྱན་པའི་ནང་དུ་ཕྱིན་ཏེ་བལྟས་ནས། དགེ་བསྙེན་མ་ཡིད་བཞིན་ཁྲི་བཟང་པོ་ལ་འདུག་པ་མཐོང་ནས།
en: Then Sudhana, the head merchant’s son, entered the Samanta­vyūha Park, looked around at everything, and saw the upāsikā Āśā seated on a magnificent throne.

source: དེ་དགེ་བསྙེན་མ་ཡིད་བཞིན་གང་ན་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་དགེ་བསྙེན་མ་ཡིད་བཞིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: He approached the upāsikā Āśā and, having reached her, bowed his head to the feet of the upāsikā Āśā.

source: དགེ་བསྙེན་མ་ཡིད་བཞིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He circumambulated her, keeping her to his right, many hundreds of thousands of times and then said, “Āryā, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: །དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་མྱ་ངན་མེད་པ་བདེ་བའི་རྒྱལ་མཚན་ཐོབ་པ་སྟེ།
en: The upāsikā Āśā said, “Noble one, I have attained the bodhisattva liberation called the banner of bliss without sorrow

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེའི་མཐུས་མཐོང་ན་དོན་ཡོད་པའོ། །མཉན་ན་དོན་ཡོད་པའོ། །རིམ་གྲོར་བྱས་ན་དོན་ཡོད་པའོ། །གནས་གཅིག་ན་འགྲོགས་པ་དོན་ཡོད་པའོ། །རྗེས་སུ་དྲན་པར་བྱས་པ་དོན་ཡོད་པའོ།
en: Noble one, through its power it is beneficial to see me, it is beneficial to hear me, it is beneficial to honor me, it is beneficial to be in one place with me, and it is beneficial to remember me.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་ཟིན་པ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་མ་དགོངས་པ་རྣམས་ཀྱིས་མཐོང་ཞིང་རྣམ་པར་དམིགས་པར་མིག་ལམ་དུ་འོང་བར་མི་འགྱུར་ཏེ།
en: “Noble one, when beings who have not developed the roots of merit, have not become pupils of a kalyāṇamitra, and have no intention to attain complete buddhahood look at me, I do not appear within their field of vision.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་མཐོང་བ་ཙམ་གྱིས་ནི་སེམས་ཅན་རྣམས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: “Noble one, merely through seeing me, beings become irreversible on the path to the highest, complete enlightenment.

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་ཁོ་མོའི་དྲུང་དུ་ཤར་ཕྱོགས་ནས་དེ་བཞིན་གཤེགས་པ་དག་བྱོན་ཅིང་། གདན་རིན་པོ་ཆེའི་ཁྲི་འདི་ལ་བཞུགས་ནས་ཆོས་སྟོན་ཏོ།
en: “Moreover, noble one, tathāgatas come from the east into my presence, and they sit on precious thrones and teach the Dharma.

source: །ཤར་ཕྱོགས་ནས་ཇི་ལྟ་བ་བཞིན་དུ་ཕྱོགས་བཅུ་ནས་ཀྱང་དེ་བཞིན་ཏེ།
en: And just as they come from the east, they come in that way from the ten directions.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན། ཁོ་མོ་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མི་འབྲལ་བའོ། །ཆོས་མཉན་པ་དང་མི་འབྲལ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་འགྲོགས་པ་དང་མི་འབྲལ་བའོ།
en: “Therefore, noble one, I am never without the sight of the tathāgatas, I am never without the teaching of the Dharma, and I am never without the company of bodhisattvas.
